pisoFoam-cavity/ras/CourseMesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     courseFace
    {
        type            zeroGradient;
        nFaces          40000;
        startFace       52920;
    }
    courseCyclicBoundary
    {
        type            cyclicAMI;
        nFaces          200;
        startFace       92920;
    }
    courseWalls
    {
        type            zeroGradient;
        nFaces          100;
        startFace       93120;
    }
    freeBoundaryCourse
    {
        type            fixedValue;
        value           uniform 0;
        nFaces          200;
        startFace       93220;
    }
    courseSymmetryWalls
    {
        type            symmetryPlane;
        nFaces          100;
        startFace       93420;
    }
    fineSymmetryWall
    {
        type            symmetryPlane;
        nFaces          80;
        startFace       93520;
    }
    fineWalls
    {
        type            zeroGradient;
        nFaces          160;
        startFace       93600;
    }
    fineCyclicBoundary
    {
        type            cyclicAMI;
        nFaces          160;
        startFace       93760;
    }
    fineplug
    {
        type            cyclicAMI;
        nFaces          80;
        startFace       93920;
    }
    faceFine
    {
        type            zeroGradient;
        nFaces          13120;
        startFace       94000;
    }
    inletFace
    {
        type            zeroGradient;
        nFaces          450;
        startFace       107120;
    }
    inlet
    {
        type            zeroGradient;
        nFaces          15;
        startFace       107570;
    }
    inletWalls
    {
        type            zeroGradient;
        nFaces          30;
        startFace       107585;
    }
    outletInlet
    {
        type            cyclicAMI;
        nFaces          15;
        startFace       107615;
    }
}

// ************************************************************************* //
